Tasks/_ИсполнениеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Task>
		<Properties>
			<Name>_ИсполнениеЗадач</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВернутьНаДоработку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДоработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьЧекЛисты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/_РаботыЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_РаботыЗаДень</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыКлиенту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗагруженоСRM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыОбращенийТехподдержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСервисДеск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/_ДанныеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_ДанныеЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВернутьНаДоработку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадачаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДоработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БП</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef._ЗадачиПоЗаявкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/_ИсполнениеЗадач/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
    
    Если ОбменДанными.Загрузка или Отказ тогда
        Возврат;
    КонецЕсли;
    
    Если не ДополнительныеСвойства.Свойство("ЭтоНовый") тогда
        ДополнительныеСвойства.ЧекЛисты.ДополнительныеСвойства.Вставить("ПропускатьПроверкуЗакрытойЗаявки"); 
        ДополнительныеСвойства.ЧекЛисты.Записать();
    КонецЕсли;
    //
    //Если не Отказ  тогда
    //    Если  ДополнительныеСвойства.Свойство("РедактированиеИзЗадачи")  тогда
    //        _ОбщийМодульСервер.ПеренестиЧлВЗаявку(Ссылка.БизнесПроцесс.Заявка);
    //    иначе
    //        Параметры = Новый Массив;
    //        Параметры.Добавить(Ссылка.БизнесПроцесс.Заявка);
    //        ФоновыеЗадания.Выполнить("_ОбщийМодульСервер.ПеренестиЧлВЗаявку", 
    //        Параметры, Новый УникальныйИдентификатор,"ПеренестиЧлВЗаявку");      
    //    КонецЕсли;
    //КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
    
    Если ОбменДанными.Загрузка тогда
        Возврат;
    КонецЕсли;
    
    ЧекЛисты = Неопределено;
    Если  не ЭтоНовый()  тогда 
        ДополнительныеСвойства.Свойство("ЧекЛисты",ЧекЛисты);
        
        Если ЧекЛисты = Неопределено Тогда 
            ЧекЛисты = РегистрыСведений._РаботыЗаДень.СоздатьНаборЗаписей();
            ЧекЛисты.Отбор.Задача.Установить(Ссылка);
            ЧекЛисты.Прочитать();
            ДополнительныеСвойства.Вставить("ЧекЛисты",ЧекЛисты);
        КонецЕсли;
        Для Каждого стр из  ЧекЛисты цикл
            
            Если не ЗначениеЗаполнено(стр.КодСтроки) тогда
                стр.КодСтроки = новый УникальныйИдентификатор;
            КонецЕсли;
            
        КонецЦикла;
    иначе 
        ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый()); 
    КонецЕсли;
    

    Если не РольДоступна("ПолныеПрава") и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок") и БизнесПроцесс.Заявка.Проверена тогда   // и не БизнесПроцесс.Отменена 
        //или БизнесПроцесс.Заявка.Статус = Перечисления._СтатусыЗаявки.Выполнена// достатчоно галки проверена) 
         ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка заблокирована для изменения, изменение задачи невозможно",,,,Отказ);
    КонецЕсли;
    
    
    Если не ЗначениеЗаполнено(ДатаПлановая) тогда
        ДатаПлановая = БизнесПроцесс.ДатаПлановая;
    КонецЕсли;
    
    
    // Наименование = БизнесПроцесс.Наименование;
    
    ЧасыФакт = ?( не ЭтоНовый(), ЧекЛисты.Итог("Часы"),0);
    Если Выполнена <> Ссылка.Выполнена и не ЗначениеЗаполнено(ДатаИсполнения) тогда
        ДатаИсполнения = ТекущаяДата();
    КонецЕсли;
    Если Отказ тогда
        Возврат 
    КонецЕсли;
    
    Блокировка = Новый БлокировкаДанных;
    ЭлементБлокировки = Блокировка.Добавить("РегистрСведений._ДанныеЗадач");
    ЭлементБлокировки.УстановитьЗначение("Задача", Ссылка);
    ЭлементБлокировки.УстановитьЗначение("БП", БизнесПроцесс);
    Блокировка.Заблокировать();
    
    
    НаборЗаписей = РегистрыСведений._ДанныеЗадач.СоздатьНаборЗаписей();
    
    НаборЗаписей.Отбор.БП.Значение = БизнесПроцесс;
    НаборЗаписей.Отбор.БП.Использование = Истина;
    
    НаборЗаписей.Отбор.Задача.Значение = Ссылка;
    НаборЗаписей.Отбор.Задача.Использование = Истина;
    
    Запись = НаборЗаписей.Добавить();
    Запись.Период = ТекущаяДата();
    Запись.БП = БизнесПроцесс;
    Запись.Задача = Ссылка;
    Запись.ВернутьНаДоработку = ВернутьНаДоработку;
    Запись.ЗадачаВыполнена = ЗадачаВыполнена;
    Запись.ОписаниеДоработки = ОписаниеДоработки;
    НаборЗаписей.Записать();
    
    Если ТочкаМаршрута = БизнесПроцессы._ЗадачиПоЗаявкам.ТочкиМаршрута.ПроверкаВыполнения 
        и не Ссылка.ВернутьНаДоработку и Ссылка.ВернутьНаДоработку и Выполнена тогда
        
        НачатьТранзакцию();
        Попытка
            Блокировка = Новый БлокировкаДанных;
            ЭлементБлокировки = Блокировка.Добавить("БизнесПроцесс._ЗадачиПоЗаявкам");
            ЭлементБлокировки.УстановитьЗначение("Ссылка", БизнесПроцесс);
            Блокировка.Заблокировать();
            
            БП =  БизнесПроцесс.ПолучитьОбъект();
            БП.Отменена = Ложь;
            БП.Записать();
            
            ЗафиксироватьТранзакцию();
        Исключение
            ОтменитьТранзакцию();
            Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        КонецПопытки;
        
    КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Наименование"));
КонецПроцедуры
